In [2]:
import duckdb

In [3]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [5]:
df = con.execute("SELECT * FROM produtos").fetchdf()
df.head(10)

     id nm_produto id_categoria  id_fornecedor  vl_preco
0  1002    MARTELO         BT50            100    1500.0
1  1001   PARAFUSO         BT10            100     100.0
2  1003      PREGO         BT10            100     150.0
3  1005    MACHADO         BT50            100    1500.0
4  1004      SERRA         BT50            100     100.0

In [6]:
df2 = df.drop(columns=['id_categoria', 'id_fornecedor'])
df2.head(10)

     id nm_produto  vl_preco
0  1002    MARTELO    1500.0
1  1001   PARAFUSO     100.0
2  1003      PREGO     150.0
3  1005    MACHADO    1500.0
4  1004      SERRA     100.0

In [17]:
con.execute("""
                CREATE TABLE IF NOT EXISTS dim_produtos (
                    id_produto BIGINT,
                    nm_produto TEXT,
                    vl_preco FLOAT)
                """)

In [16]:
con.execute("DROP TABLE IF EXISTS dim_produtos").fetchdf()

Empty DataFrame
Columns: [Success]
Index: []

In [9]:
df_dim = con.execute("SELECT * FROM dim_produtos").fetchdf()
df_dim.head(10)

Empty DataFrame
Columns: [id_produto, nm_produto, vl_preco]
Index: []

In [18]:
con.execute("INSERT INTO dim_produtos SELECT * FROM df2")
df_dim = con.execute("SELECT * FROM dim_produtos").fetchdf()
df_dim.head(10)

   id_produto nm_produto  vl_preco
0        1002    MARTELO    1500.0
1        1001   PARAFUSO     100.0
2        1003      PREGO     150.0
3        1005    MACHADO    1500.0
4        1004      SERRA     100.0

In [19]:
con.close()